app/views/sessions/show.html.erb

<%= form_for @session do |f|%>
    <%= collection_select :category, :category_id, Category.all, :id, :name %><br>
---
SELECT "categories".* FROM "categories"