app/views/games/lobby.html.erb

     <label>Solo Game:</label><br>
       <%= collection_select :category, :category_id, Category.all, :id, :name %><br>
---
SELECT "categories".* FROM "categories"