app/controllers/games_controller.rb

    def show
       @game = Game.find_by(id: params[:id])
       @category = Category.find_by(id: params[:id])
       @current_user = User.find_by(id: session[:user_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create

      if params["Create"] == "Start Game"
        @questions = Question.find_by(category_id: params[:category_id])
        category_id = game_params
        @game = Game.create(user_id: session[:user_id], category_id: 9)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."category_id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "games" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 11], ["created_at", "2019-06-19 21:58:46.993637"], ["updated_at", "2019-06-19 21:58:46.993637"]]