app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "JS"], ["LIMIT", 1]]
---
    def show

        @session = User.find_by(username: params[:username])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ruby"], ["LIMIT", 1]]
---
    def create
      if params["authenticate"] == "signup"
        @user = User.new(user_params)
        @user.save
        redirect_to lobby_path(:username => @user.username)
      elsif params["authenticate"] == "login"
        user = User.find_by(username: params[:username])